import React from "react";
import ExpandMoreIcon from "@material-ui/icons/ExpandMore";
import {
  Accordion,
  AccordionDetails,
  AccordionSummary,
  Container,
  Grid,
  Typography,
} from "@material-ui/core";

const content = [
  {
    id: 1,
    title: "Чи можна відправити замовлення іншій людині?",
    text:
      "Можна, для цього в кошику вкажіть, що отримувач інша людина, та заповніть її контактні дані.\n" +
      "Ви також можете оплатити доставку онлайн одразу при оформленні замовлення, для цього\n" +
      "оберіть відповідну опцію при оформленні замовлення у кошику.",
  },
  {
    id: 2,
    title: "Чи можна одразу оплатити доставку?",
    text: "Можна, для цього треба вказати, що отримувач інша людина, а потім обрати опцію сплати доставки разом з оплатою замовлення.",
  },
  {
    id: 3,
    title: "Чи можна оплатити на пошті при отриманні?",
    text:
      'Можна, обравши спосіб оплати "Часткова передоплата (100 грн) + накладений платіж"\n' +
      "Проте все одно знадобиться передоплата в розмірі 100 грн. Залишок оплачується безпосередньо на вашому відділенні Нової Пошти.",
  },
  {
    id: 4,
    title: "Навіщо передоплата 100 грн?",
    text:
      "Трапляються випадки, коли клієнти роблять замовлення, проте так і не приходять за ним на відділення.\n" +
      "\n" +
      "В таких випадках нам доводиться повертати посилку та оплачувати пересилку в 2 сторони.\n" +
      "\n" +
      "Для уникнення таких випадків ми вимушені брати передоплату в розмірі 100 грн.",
  },
  {
    id: 5,
    title: "Що таке накладений платіж?",
    text:
      "Накладений платіж - це послуга перевізника , за якої отримувач має змогу оплатити (готівкою або карткою) товар безпосередньо при отриманні. Слід враховувати, що за дану послугу перевізник бере комісію в розмірі 20 грн + 2% суми оплати за товар на пошті.\n" +
      "\n" +
      "Детальніше умови доставки та оплати: tviybox.com/pay\n" +
      "Тарифи на сайті перевізника: novaposhta.ua/uploads/misc/doc/calculation_delivery_cost_ua.pdf",
  },
  {
    id: 6,
    title: "А ви не шахраї?",
    text:
      "Друзі, наш сервіс успішно працює з лютого 2018 року та продовжує розвиватись.\n" +
      'Ми цінуємо свою репуатцію, а тому ніколи б не стали навіть намагатись когось "кинути".\n' +
      "\n" +
      "Кількість сил покладених на створення та розвиток проекту аж ніяк не вартує короткотермінової вигоди від різних шахрайських схем.\n" +
      "\n" +
      "Вся діяльність здіснюється відкрито та прозоро. В разі потреби ви завжди можете написати власнику проекту: instagram.com/mg.create/\n" +
      "\n" +
      "Наш інстаграм: instagram.com/tviy.box/",
  },
  {
    id: 7,
    title: "Скільки коштує доставка до мого міста?",
    text:
      "Вартість доставки вирахується автоматично після заповнення потрібних контактних даних\n" +
      "під час оформлення замовлення.",
  },
  {
    id: 8,
    title: "Як довго буде йти посилка до мого міста?",
    text: "Ось тут зручно розрахувати строки доставки посилки: novaposhta.ua/ru/onlineorder/estimatedate",
  },
  {
    id: 9,
    title: "Чи можна замовити доставку на певну дату?",
    text: "За терміни доставки відповідає Нова Пошта, але ви можете вказати бажаний день відправки під час оформлення замовлення. Зазвичай доставка Новою Поштою триває 1-2 дні.",
  },
  {
    id: 10,
    title: "Чи можна підписати листівку від мого імені?",
    text:
      "Так. Просто вкажіть текст привітання в коментарі до замовлення.\n" +
      "Текст не має перевищувати 50 слів.",
  },
];

const FaqPageScreen = () => {
  return (
    <Grid container justifyContent="center">
      <Grid
        item
        xs={12}
        style={{ padding: "48px 0", backgroundColor: "#E5E5E5" }}
      >
        <Typography align="center" variant="h2">
          Часто задавані запитання (FAQ)
        </Typography>
      </Grid>
      <Grid item xs={12} style={{ marginTop: 80 }}>
        <Grid container>
          <Container maxWidth="md">
            {content.map((item) => {
              return (
                <Grid key={item.id} item xs={12}>
                  <Accordion>
                    <AccordionSummary expandIcon={<ExpandMoreIcon />}>
                      <Typography variant="h6">{item.title}</Typography>
                    </AccordionSummary>
                    <AccordionDetails>
                      <Typography variant="body2">{item.text}</Typography>
                    </AccordionDetails>
                  </Accordion>
                </Grid>
              );
            })}
          </Container>
        </Grid>
      </Grid>
    </Grid>
  );
};

export default FaqPageScreen;
