export const boxes = [
  {
    id: 1,
    img: "/static/image.png",
    title: "Весняний комплімент №2",
    description:
      "Бокс-комплімент з яскравою чашкою, крем-медом, листівкою, Ritter Mini та Raffaello",
    price: 320,
  },
  {
    id: 2,
    img: "/static/image.png",
    title: "Бокс Pantone Colors",
    description:
      "Бокс в барвах топових кольорів Pantone. Обери свій колір. Від 2 шт",
    price: 350,
  },
  {
    id: 3,
    img: "/static/image.png",
    title: "Весняний комплімент №3",
    description: "Ще один затишний весняний бокс-комлімент",
    price: 270,
  },
  {
    id: 4,
    img: "/static/image.png",
    title: "Весняний комплімент №2",
    description:
      "Бокс-комплімент з яскравою чашкою, крем-медом, листівкою, Ritter Mini та Raffaello",
    price: 320,
  },
  {
    id: 5,
    img: "/static/image.png",
    title: "Бокс Pantone Colors",
    description:
      "Бокс в барвах топових кольорів Pantone. Обери свій колір. Від 2 шт. Бокс в барвах топових кольорів Pantone. Обери свій колір. Від 2 шт.Бокс в барвах топових кольорів Pantone. Обери свій колір. Від 2 шт",
    price: 350,
  },
  {
    id: 6,
    img: "/static/image.png",
    title: "Весняний комплімент №3",
    description: "Ще один затишний весняний бокс-комлімент",
    price: 270,
  },
  {
    id: 7,
    img: "/static/image.png",
    title: "Весняний комплімент №3",
    description: "Ще один затишний весняний бокс-комлімент",
    price: 270,
  },
  {
    id: 8,
    img: "/static/image.png",
    title: "Весняний комплімент №2",
    description:
      "Бокс-комплімент з яскравою чашкою, крем-медом, листівкою, Ritter Mini та Raffaello",
    price: 320,
  },
  {
    id: 9,
    img: "/static/image.png",
    title: "Бокс Pantone Colors",
    description:
      "Бокс в барвах топових кольорів Pantone. Обери свій колір. Від 2 шт",
    price: 350,
  },
];

export const corporateBoxes = [
  {
    id: 1,
    img: "/static/image.png",
    title: "Готові чи індивідуальні бокси",
    description:
      "Можна обрати серед готових боксів в нашому каталозі або ж створити свій бокс на онлайн конструкторі",
  },
  {
    id: 2,
    img: "/static/image.png",
    title: "Різноманітне пакування",
    description: "Дерево або крафт. Мотузка, стрічка або ж подарунковий папір",
  },
  {
    id: 3,
    img: "/static/image.png",
    title: "Гравіювання на дерев'яних коробках",
    description:
      "Приємний на дотик матеріал, якісне гравіювання та зйомна кришка. Всередині деревна шерсть для затишного вигляду",
  },
  {
    id: 4,
    img: "/static/image.png",
    title: "Друк на крафтових коробках",
    description:
      "Забрендуємо крафтові коробки за допомогою друку. Розмір коробки підбирається під наповнення боксу. Від 100 шт",
  },
  {
    id: 5,
    img: "/static/image.png",
    title: "Інидвідуальний дизайн листівок",
    description:
      "Забрендуємо наші готові дизайни або ж роздрукуємо ваш дизайн. На звороті можна розмістити ваші побажання. Від 50 шт",
  },
  {
    id: 6,
    img: "/static/image.png",
    title: "Брендування за допомогою стікерів",
    description:
      "Простий та швидкий спосіб забрендувати подарунок. Від 20 шт. Від 2 днів",
  },
  {
    id: 7,
    img: "/static/image.png",
    title: "Індивідуальний дизайн чашок",
    description:
      "Забрендуємо наші готові дизайни або ж роздрукуємо ваш дизайн. Можливий друк у притул до верхньої грані. Від 20 шт",
  },
  {
    id: 8,
    img: "/static/image.png",
    title: "Індивідуальний дизайн блокнотів",
    description:
      "Забрендуємо наші готові дизайни або ж роздрукуємо ваш дизайн. Від 100 шт",
  },
  {
    id: 9,
    img: "/static/image.png",
    title: "Індивідуальний дизайн імбирного печива",
    description:
      "Брендування імбирного печива. Можливо зробити у формі лого або ж за іншим наданим дизайном. Від 20 шт",
  },
  {
    id: 10,
    img: "/static/image.png",
    title: "Брендування батончиків",
    description: "Брендування етикетки на енергетичних батончиках. Від 100 шт",
  },
  {
    id: 11,
    img: "/static/image.png",
    title: "Брендування солоної карамелі",
    description: "Брендування етикетки на солоний карамелі. Від 100 шт",
  },
  {
    id: 12,
    img: "/static/image.png",
    title: "Брендування арахісової пасти",
    description: "Брендування етикетки на арахісовий пасті. Від 100 шт",
  },
];
